{
  "arbitrage": {
    "explanation1": "\n Arbitrage is a way of betting that guarantees a net win for the winner by \n taking advantage of differences in the posted odds by different bookmakers. \n This usually happens when one bookmaker judges the odds of one team winning \n slightly higher than another bookmaker. To calculate this for decimal odds, \n you need to find two opposing odds whose inverses sum to less than one. \n That is, for two odds n1 and n2, (1/n1) + (1/n2) < 1.",
    "example": "\n Here is a worked example: if website 1 has the odds (1.25, 3.9) and website \n 2 has the odds (1.43, 2.85) for a certain game, we observe that \n (1/1.43) + (1/3.9) = 0.956 < 1. After calculating this, for every \n 100 dollars you place on outcome 1, website 2, you bet (1.43/3.9) * 100 \n dollars on outcome 2, website 1. By betting a total of $136.67 on both \n bets, you are guaranteed to get $143 no matter who wins. Therefore, you \n would make a profit of $6.33 for every $100 bet. Note that this calculation \n and program doesn't take into account any fees that the sites may add on \n top of the bets, so the margins for profit may be rather slim.",
    "explanation2": "\n This can also be done with any other kind of odds easily by converting to \n decimal. It can also be done with 3 way odds using another formula: let \n B be the sum of bets, let s1,s2, and s3 be the odds for outcomes; the bet \n on each outcome can be calculated as b1 = B/(1 + (s1/s2) + (s1/s3)), \n b2 = B/(1 + (s2/s1) + (s2/s3)), b3 = B/(1 + (s3/s1) + (s3/s2)).\n"
  },
  "odds": {
    "introduction": "\n There are two types of odds used in sports betting: American and decimal.",
    "american_explanation": "\n When using American odds, odds are represented with a plus or minus sign, \n and typically has three digits. Negative numbers indicate favorites, and \n positive numbers indicate underdogs. For negative numbers, the number \n shown indicates how much you would have to bet to win back $100. That is, \n a +110 odd means that for a $110 dollar bet, you would get $100 back if \n the team you bet on won. Similarly, if you bet $100, you would only get \n (100/110) * $100 back on winning. For positive numbers, the number \n represents how much you would get back if you bet $100.\n",
    "decimal_explanation": "\n Decimal odds are instead represented with a positive number rounded to the \n tenths. It simply shows how much money your stake would be multiplied by \n if you win. For example, if the decimal odd is 2.0, and you bet $100, \n then you would win $200. Naturally, the closer the decimal is to 1.0, \n the more favored that side of the matchup is, since the reward is low. \n On the other hand, if the odd is very large, then that side is a clear \n underdog."
  },
  "conversion": {
    "explanation1": "\n You can convert from American to decimal odds by employing a piecewise \n formula. For positive American odds, you should take 1 + (american_odds/100). \n For negative American odds, you should take 1 - (100/american_odds).",
    "example1": "\n For example, if you had the American odds (-280, +300), you would calculate \n the decimal odds as follows: -280 goes into the formula 1 - (100/-280) = \n 1.357. +300 goes into the formula 1 + (300/100) = 4. So your decimal odds \n would be (1.36, 4.00).",
    "explanation2": "\n Converting from decimal to American uses a similar process but in reverse. \n If the odds are greater than 2.0, you would end up with positive American \n odds with the formula (decimal_odds - 1)*100. On the other hand, if the \n decimal is less than 2.0, you would convert to negative American odds, \n odds, calculated by -100/(decimal_odds - 1). The 2.0 threshold is very \n intuitive, since it represents a 50-50 chance of either side winning. \n Any decimal odd above 2.0 would naturally be considered an underdog, \n since with higher reward comes higher risk. And anything below 2.0 \n indicates a favorite because of the low risk and low reward.",
    "example2": "\n For example, if you had the decimal odds (1.4, 5.4), you would calculate \n the lower odd into negative American odds, since it is less than 2. So, \n 1.4 goes into the formula -100/(1.4 - 1) = -250. The larger odd would \n turn into (5.4 - 1)*100 = +440.\n"
  },
  "probability": {
    "introduction": "\n Behind every listing of sports odds, there is an implied probability at \n which the bookmakers deemed each side to win. Note that these probabilities \n are prediction made by the bookmakers so that they can set the odds in a \n manner that they can profit off of. But if several places have similar\n odds for a certain game, then the analysts likely came to an agreement on \n their predictions.",
    "decimal_explanation": "\n With decimal odds, this probability is simply the reciprocal, or 1 divided \n by the decimal.",
    "decimal_example": "\n For example, if you had the odds (1.67, 2.50), you would simply calculate \n the probabilities by taking their reciprocal. The lower one becomes \n 1/1.67 = 0.6; the higher one becomes 1/2.5 = 0.4.",
    "american_explanation": "\n For American odds, you have to use a piecewise function. For positive \n American odds, you calculate 100/(american_odds + 100). For negative\n American odds, you calculate american_odds/(american_odds + 100). ",
    "american_example": "\n For example, let the odds for a game be (-280, +220). For the negative \n value, you use the formula -280/(-280 + 100) = 0.737; for the positive \n value, you use the formula 100/(220 + 100) = 0.313.\n"
  }
}